"use strict";
var __importDefault = (this && this.__importDefault) || function (mod) {
    return (mod && mod.__esModule) ? mod : { "default": mod };
};
Object.defineProperty(exports, "__esModule", { value: true });
const express_1 = __importDefault(require("express"));
const cors_1 = __importDefault(require("cors"));
const app = (0, express_1.default)();
const PORT = process.env.PORT || 5000;
app.use(((0, cors_1.default)()));
app.use('/static', express_1.default.static('public'));
app.get('/', (req, res) => {
    res.json([{
            id: 1,
            imgSrc: 'http://localhost:5000/static/image/room.png',
            altDescript: 'Изображение квартиры',
            price: '65.00 BYN',
            text1: 'Минск, б-р Мулявина, д. 10',
            text2: 'Грушевка',
            text3: 'Шабаны',
            descript: 'Какое-то описание квартиры, описание квартиры, описание квартиры, описание квартиры, описание квартиры, описание квартиры, описание квартиры, описание квартиры, описание квартиры, описание ...'
        },
        {
            id: 2,
            imgSrc: 'http://localhost:5000/static/image/MaskGroup.png',
            altDescript: 'Изображение квартиры',
            price: '65.00 BYN',
            text1: 'Минск, б-р Мулявина, д. 10',
            text2: 'Грушевка',
            text3: 'Шабаны',
            descript: 'Какое-то описание квартиры, описание квартиры, описание квартиры, описание квартиры, описание квартиры, описание квартиры, описание квартиры, описание квартиры, описание квартиры, описание ...'
        },
        {
            id: 3,
            imgSrc: 'http://localhost:5000/static/image/MaskGroup3.png',
            altDescript: 'Изображение квартиры',
            price: '65.00 BYN',
            text1: 'Минск, б-р Мулявина, д. 10',
            text2: 'Грушевка',
            text3: 'Шабаны',
            descript: 'Какое-то описание квартиры, описание квартиры, описание квартиры, описание квартиры, описание квартиры, описание квартиры, описание квартиры, описание квартиры, описание квартиры, описание ...'
        },
        {
            id: 4,
            imgSrc: 'http://localhost:5000/static/image/MaskGroup.png',
            altDescript: 'Изображение квартиры',
            price: '65.00 BYN',
            text1: 'Минск, б-р Мулявина, д. 10',
            text2: 'Грушевка',
            text3: 'Шабаны',
            descript: 'Какое-то описание квартиры, описание квартиры, описание квартиры, описание квартиры, описание квартиры, описание квартиры, описание квартиры, описание квартиры, описание квартиры, описание ...'
        },
        {
            id: 5,
            imgSrc: 'http://localhost:5000/static/image/MaskGroup.png',
            altDescript: 'Изображение квартиры',
            price: '65.00 BYN',
            text1: 'Минск, б-р Мулявина, д. 10',
            text2: 'Грушевка',
            text3: 'Шабаны',
            descript: 'Какое-то описание квартиры, описание квартиры, описание квартиры, описание квартиры, описание квартиры, описание квартиры, описание квартиры, описание квартиры, описание квартиры, описание ...'
        },
        {
            id: 6,
            imgSrc: 'http://localhost:5000/static/image/MaskGroup.png',
            altDescript: 'Изображение квартиры',
            price: '65.00 BYN',
            text1: 'Минск, б-р Мулявина, д. 10',
            text2: 'Грушевка',
            text3: 'Шабаны',
            descript: 'Какое-то описание квартиры, описание квартиры, описание квартиры, описание квартиры, описание квартиры, описание квартиры, описание квартиры, описание квартиры, описание квартиры, описание ...'
        }
    ]);
});
app.get('/articles', (req, res) => {
    res.json([
        {
            id: 1,
            imgSrc: 'http://localhost:5000/static/image/imageCards/ban1.jpg',
            title: 'Баня Русская С душой',
            description: 'В Бане С душой вы можете посетить традиционную баню на дровах - проверенную веками и особенно любимую жителями больших городов. Уютный звук сгорающих в печи дров, запах натурального дерева рождают у нас добрые чувства.',
            altTitle: 'Фото бани'
        },
        {
            id: 2,
            imgSrc: 'http://localhost:5000/static/image/imageCards/ban.jpg',
            title: ' Банька с веничком на двоих',
            description: 'В сауну Банька с веничком на двоих вы можете прийти веселой компанией, арендовать парную на всех, пообщаться и отдохнуть. У нас вы сможете найти : бодрящую купель, пахучие веники, бильярд, уютную комнату отдыха ',
            altTitle: 'Фото бани'
        },
        {
            id: 3,
            imgSrc: 'http://localhost:5000/static/image/imageCards/ban2.jpeg',
            title: 'Баня На Волге',
            description: 'К Вашим услугам представлены: парная с немецкой дровяной печью (топиться дубовыми дровами). Самый большой бассейн (Саратовское водохранилище).',
            altTitle: 'Фото бани'
        }
    ]);
});
app.get('/articlHome', (req, res) => {
    res.json([
        {
            id: 1,
            imgSrc: 'http://localhost:5000/static/image/imageCards/home1.jpeg',
            title: 'Коттеджный комплекс «Ручеёк»',
            description: 'Коттеджный Банный комплекс «Ручеёк» предлагает снять дом/коттедж в Люберцах недорого на сутки. Во дворе мангал, беседка, купель.',
            altTitle: 'Фото Коттеджа'
        },
        {
            id: 2,
            imgSrc: 'http://localhost:5000/static/image/imageCards/home2.jpg',
            title: ' Прованс',
            description: 'Предлагаем вам отдохнуть в атмосферном загородном доме в стиле французского прованса. В коттедже вы найдете все необходимое, чтобы провести тихий уютный вечер с друзьями или устроить веселую вечеринку ',
            altTitle: 'Фото Коттеджа'
        },
        {
            id: 3,
            imgSrc: 'http://localhost:5000/static/image/imageCards/home3.jpeg',
            title: 'Гостевой дом-вилла',
            description: 'Комфортный, уютный двухэтажный коттедж в стиле Вилла - отдых на природе с городским комфортом.',
            altTitle: 'Фото бани'
        }
    ]);
});
app.get('/articlManor', (req, res) => {
    res.json([
        {
            id: 1,
            imgSrc: 'http://localhost:5000/static/image/imageCards/Manor1.jpg',
            title: 'Усадьба Чапских',
            description: 'Чапские – прославленный графский род, который владел на территории Беларуси несколькими прекрасными резиденциями. Одна из них находится совсем близко к Минску.',
            altTitle: 'Фото Усадьбы'
        },
        {
            id: 2,
            imgSrc: 'http://localhost:5000/static/image/imageCards/Manor2.jpeg',
            title: 'Дворец Огинского',
            description: 'Дворцово-парковая территория открыта для прогулок, экскурсий и чаепитий в уютном кафе с плетенными столиками. ',
            altTitle: 'Фото Усадьбы'
        },
        {
            id: 3,
            imgSrc: 'http://localhost:5000/static/image/imageCards/Manor3.jpg',
            title: 'Дворец Потемкиных и Голынских',
            description: 'Известно, что дворец был построен для Григория Потемкина, фаворита Екатерины II, по проекту Ивана Старова, который работал над Таврическим дворцом в Санкт-Петербурге...',
            altTitle: 'Фото Усадьбы'
        }
    ]);
});
app.get('/articlDefaultManor', (req, res) => {
    res.json([
        {
            id: 1,
            imgSrc: 'http://localhost:5000/static/image/room.png',
            title: 'Линия Сталина: суровый отдых в усадьбах на сутки',
            description: 'Чем заняться в выходные? Когда нет безотлагательных домашних дел, а на улице хорошая погода, хочется уехать из города, чтобы сменить обстановку. Например, снять коттедж на сутки для семьи или большой компании друзей. А...',
            altTitle: 'Фото Усадьбы'
        },
        {
            id: 2,
            imgSrc: 'http://localhost:5000/static/image/room.png',
            title: 'Линия Сталина: суровый отдых в усадьбах на сутки',
            description: 'Чем заняться в выходные? Когда нет безотлагательных домашних дел, а на улице хорошая погода, хочется уехать из города, чтобы сменить обстановку. Например, снять коттедж на сутки для семьи или большой компании друзей. А...',
            altTitle: 'Фото Усадьбы'
        },
        {
            id: 3,
            imgSrc: 'http://localhost:5000/static/image/room.png',
            title: 'Линия Сталина: суровый отдых в усадьбах на сутки',
            description: 'Чем заняться в выходные? Когда нет безотлагательных домашних дел, а на улице хорошая погода, хочется уехать из города, чтобы сменить обстановку. Например, снять коттедж на сутки для семьи или большой компании друзей. А...',
            altTitle: 'Фото Усадьбы'
        }
    ]);
});
app.listen(PORT, () => { console.log(`server is listening on port ${PORT}`); });
//# sourceMappingURL=server.js.map